// 数组
// 一维数组
// 二维数组
// 多维数组
// 字符
// 字符串
// 字符数组
#include <stdio.h>

int main(int argc, char *argv[])
{
    // label1:
    printf("第5次课\n");
    printf("数组\n");
    int a;
    a = 1;
    // 数组：相同类型的数据集合，存储在连续的内存空间中，通过下标访问，是有序的
    // 一维数组

    // 声明数组：数据类型 数组名[数组长度];
    int arr[3];      // 3个整数的数组 一维数组 只有一行
    double arr2[10]; // 10个双精度浮点数的数组 一维数组 只有一行
    float arr3[5];   // 10个单精度浮点数的数组 一维数组 只有一行
    // 初始化数组，如果不初始化，数组中的元素是随机的

    // 先声明再初始化
    // 数组名[下标/索引] = 值;
    arr[0] = 1;
    arr[1] = 2;
    arr[2] = 3;
    // arr这个数组的长度是3，下标是0,1,2，存的是1,2,3

    // 声明数组的同时初始化数组
    // 数据类型 数组名[数组长度] = {值1, 值2, 值3...};
    float arr4[5] = {1.1, 2.2, 3.3, 4.4, 5.5};
    // arr4这个数组的长度是5，下标是0,1,2,3,4，存的是1.1,2.2,3.3,4.4,5.5

    // 声明同时初始化数组 数组长度可以省略
    int arr5[] = {1, 2, 3, 4, 5};
    // arr5这个数组的长度是5，下标是0,1,2,3,4，存的是1,2,3,4,5

    int arr6[3] = {1};
    // arr6这个数组的长度是3，下标是0,1,2，存的是1 0 0
    printf("%d\n", arr6[0]); // arr6的第一个元素
    printf("%d\n", arr6[1]); // arr6的第二个元素
    printf("%d\n", arr6[2]); // arr6的第三个元素

    // 访问数组元素 通过下标/索引来访问的，下标从[0]开始一直到[数组长度-1]
    float arr7[4] = {1.1, 100.0, 7.1, 6.12};
    printf("%f\n", arr7[0]); // 第一个元素 1.1
    printf("%f\n", arr7[1]); // 第二个元素 100.0
    printf("%f\n", arr7[2]); // 第三个元素 7.1
    printf("%f\n", arr7[3]); // 第四个元素 6.12
    printf("%f\n", arr7[4]); // 第五个元素，越界访问，输出的是随机值，C语言里不对越界访问做检查

    // 更改数组元素的值
    // 更改arr7的第2个元素的值为7.12
    arr7[1] = 7.12;
    printf("%f\n", arr7[1]); // 第二个元素 7.12
    // 此时arr7的第2个元素的值已经变成了7.12
    // arr7 = {1.1, 7.12, 7.1, 6.12} 4个元素

    printf("循环遍历数组\n");
    // 循环遍历数组,循环遍历下标 下标应该从0~数组长度-1
    // while循环
    int i = 0; // 下标
    while (i <= (sizeof(arr7) / sizeof(arr7[0])) - 1)
    {
        printf("%f\n", arr7[i]);
        i++;
    }
    // for循环 课后作业

    printf("数组的长度\n");
    // 数组的长度
    // 定义数组的时候我们都指定了数组的长度，但是有时候我们并不知道数组的长度
    int arr8[] = {1, 2, 3, 4, 5};
    // sizeof() 计算数据类型或者变量的长度,单位是字节
    printf("数组的内存空间大小%d\n", sizeof(arr8));               // 数组所占的内存空间大小 20字节
    printf("数组中一个元素的内存空间大小%d\n", sizeof(arr8[0]));  // 数组中的一个元素所占的内存空间大小 4字节
    printf("数组的元素个数%d\n", sizeof(arr8) / sizeof(arr8[0])); // 数组的长度 5:20/4=5 五个元素

    printf("多维数组\n");
    // 多维数组
    // 声明
    // 数据类型 数组名[第一维长度][第二维长度]...;
    int arr9[3][4]; // 3行4列的二维数组
    arr9[0][0] = 1;
    arr9[0][1] = 2;
    arr9[0][2] = 3;
    arr9[0][3] = 4;
    arr9[1][0] = 5;
    arr9[1][1] = 6;
    arr9[1][2] = 7;
    arr9[1][3] = 8;
    arr9[2][0] = 9;
    arr9[2][1] = 10;
    arr9[2][2] = 11;
    arr9[2][3] = 12;
    // int arr9[3][4] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12};
    // int arr9[3][4] = {{1, 2, 3, 4}, {5, 6, 7, 8}, {9, 10, 11, 12}};
    // 1 2 3 4
    // 5 6 7 8
    // 9 10 11 12
    // 循环遍历二维数组 循环嵌套
    for (int j = 0; j <= 2; j++) // 控制行数
    {
        for (int k = 0; k <= 3; k++) // 控制列数
        {
            printf("%d ", arr9[j][k]);
        }
        printf("\n");
    }
    // while循环遍历二维数组 课后作业

    // 四维数组
    // // 3个3维数组，每个3维数组有4行5列 arr10[0][2][2][3]
    int arr10[3][4][5][6] = {
        {
            {
                {1, 2, 3, 4, 5, 6},
                {7, 8, 9, 10, 11, 12},
                {13, 14, 15, 16, 17, 18},
                {19, 20, 21, 22, 23, 24},
                {25, 26, 27, 28, 29, 30},
            },
            {
                {31, 32, 33, 34, 35, 36},
                {37, 38, 39, 40, 41, 42},
                {43, 44, 45, 46, 47, 48},
                {49, 50, 51, 52, 53, 54},
                {55, 56, 57, 58, 59, 60},
            },
            {
                {61, 62, 63, 64, 65, 66},
                {67, 68, 69, 70, 71, 72},
                {73, 74, 75, 76, 77, 78},
                {79, 80, 81, 82, 83, 84},
                {85, 86, 87, 88, 89, 90},
            },
            {
                {91, 92, 93, 94, 95, 96},
                {97, 98, 99, 100, 101, 102},
                {103, 104, 105, 106, 107, 108},
                {109, 110, 111, 112, 113, 114},
                {115, 116, 117, 118, 119, 120},
            },
        },
        {
            {
                {121, 122, 123, 124, 125, 126},
                {127, 128, 129, 130, 131, 132},
                {133, 134, 135, 136, 137, 138},
                {139, 140, 141, 142, 143, 144},
                {145, 146, 147, 148, 149, 150},
            },
            {
                {151, 152, 153, 154, 155, 156},
                {157, 158, 159, 160, 161, 162},
                {163, 164, 165, 166, 167, 168},
                {169, 170, 171, 172, 173, 174},
                {175, 176, 177, 178, 179, 180},
            },
            {
                {181, 182, 183, 184, 185, 186},
                {187, 188, 189, 190, 191, 192},
                {193, 194, 195, 196, 197, 198},
                {199, 200, 201, 202, 203, 204},
                {205, 206, 207, 208, 209, 210},
            },
            {
                {211, 212, 213, 214, 215, 216},
                {217, 218, 219, 220, 221, 222},
                {223, 224, 225, 226, 227, 228},
                {229, 230, 231, 232, 233, 234},
                {235, 236, 237, 238, 239, 240},
            },
        },
        {
            {
                {241, 242, 243, 244, 245, 246},
                {247, 248, 249, 250, 251, 252},
                {253, 254, 255, 256, 257, 258},
                {259, 260, 261, 262, 263, 264},
                {265, 266, 267, 268, 269, 270},
            },
            {
                {271, 272, 273, 274, 275, 276},
                {277, 278, 279, 280, 281, 282},
                {283, 284, 285, 286, 287, 288},
                {289, 290, 291, 292, 293, 294},
                {295, 296, 297, 298, 299, 300},
            },
            {
                {301, 302, 303, 304, 305, 306},
                {307, 308, 309, 310, 311, 312},
                {313, 314, 315, 316, 317, 318},
                {319, 320, 321, 322, 323, 324},
                {325, 326, 327, 328, 329, 330},
            },
            {
                {331, 332, 333, 334, 335, 336},
                {337, 338, 339, 340, 341, 342},
                {343, 344, 345, 346, 347, 348},
                {349, 350, 351, 352, 353, 354},
                {355, 356, 357, 358, 359, 360},
            },
        },
    };
    printf("%d\n", arr10[0][2][2][3]); // 76
    // 遍历四维数组
    for (int m = 0; m <= 2; m++) // 控制第一维
    {
        for (int n = 0; n <= 3; n++) // 控制第二维
        {
            for (int o = 0; o <= 4; o++) // 控制第三维
            {
                for (int p = 0; p <= 5; p++) // 控制第四维
                {
                    printf("%d ", arr10[m][n][o][p]);
                }
                printf("\n");
            }
            printf("\n");
        }
        printf("\n");
    }

    int arr11[3] = {1, 2, 3};

    int q = 3;
    // int arr12[q] = {1, 2, 3}; // 变量作为数组的长度
    // 会报错的，C语言不支持变量作为数组的长度
    // 因为编译器在编译的时候需要知道数组的长度，才能分配内存空间
    // 动态分配内存

    // 字符串=字符数组=一串字符
    char arr12[] = {'a', 'b', 'c', 'd', 'e', '\0'};
    // 字符串的结束标志是'\0'，ASCII码是0，必须要有结束标志
    char arr13[] = "abcde"; //""表示字符串
    // '\0'默认添加在字符串的末尾
    // 'a' "a"
    printf("%d\n", sizeof('\0'));    // 一个字符是1个字节，但是单字符是以整型存储的，所以sizeof('a')是4
    printf("%d\n", sizeof("abcde")); // 6 字符串的长度是5，加上结束标志'\0'是6
    // 字符串是以字符数组的形式存储的，所以sizeof("abcde")是6=5+1
    printf("%d\n", sizeof(arr13[0])); // 一个字节
    return 0;
}