str="""
       0000      0000\n     0000000    0000000
   0000000000  00000000000
  0000000000000000000000000
   00000000000000000000000
    000000000000000000000
     0000000000000000000
       000000000000000
         00000000000
           0000000
             000""" 
           
print(str)


while True:
    ryy=int(input('请输入年份：'))
    print(ryy)
    if ryy%400==0:
        print('闰年')
    elif ryy%100==0:
        print('不是闰年')
    elif ryy%4==0:
        print('闰年')
    else:
        print('不是闰年')
